/*
 * ============================================
 *  CONFIG - สุดยอดแฟนพันธุ์แห่งปี 2026
 * ============================================
 *
 *  แก้ไขข้อมูลด้านล่างเพื่อกำหนดคำถามและคำตอบ
 *  สำหรับแต่ละหมวดของเกม
 *
 */

const GAME_CONFIG = {
    "threeSecondsHeaders": [
        "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
        "หลังจิ๊กซอว์นี้ นี่คือภาพของบุคคลที่เกี่ยวข้องกับวง Bodyslam ที่มีชื่อว่าอะไร",
        "นี่คือคุณสมบัติของเพลงอะไร"
    ],
    "threeSeconds": [
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_1.mp3",
            "answer": "ยาพิษ"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_2.mp3",
            "answer": "อกหัก"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_3.mp3",
            "answer": "ขอบฟ้า"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_4.mp3",
            "answer": "คนที่คุณรัก"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_5.mp3",
            "answer": "ความเชื่อ"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_6.mp3",
            "answer": "คราม"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_7.mp3",
            "answer": "เรือเล็กควรออกจากฝั่ง"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_8.mp3",
            "answer": "คิดฮอด"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_9.mp3",
            "answer": "งมงาย"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_10.mp3",
            "answer": "ปลายทาง"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_11.mp3",
            "answer": "149.6"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_12.mp3",
            "answer": "เตรียมตัวตาย"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_13.mp3",
            "answer": "ยิ่งรู้ยิ่งไม่เข้าใจ"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_14.mp3",
            "answer": "ความซื่อสัตย์"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_15.mp3",
            "answer": "วันสิ้นปี"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_16.mp3",
            "answer": "ห้ามใจ"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_17.mp3",
            "answer": "นาฬิกาตาย"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_18.mp3",
            "answer": "เงา"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_19.mp3",
            "answer": "ครึ่ง ๆ กลาง ๆ"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_20.mp3",
            "answer": "เหว"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_21.mp3",
            "answer": "ภาพลวงตา"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_22.mp3",
            "answer": "Away"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_23.mp3",
            "answer": "ดัม-มะ-ชา-ติ"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_24.mp3",
            "answer": "ปิดปรับปรุง"
        },
        {
            "question": "ช่วงต้นของเพลงที่กำลังจะได้ยินนี้ มาจากเพลงที่มีชื่อว่าอะไร",
            "image": null,
            "audio": "public/img/BD_25.mp3",
            "answer": "แสงสุดท้าย"
        }
    ],
    "qa": {
        "question": "เพลงแรกของ Bodyslam ที่ใช้เทคโนโลยีในการทำ MV แบบ 360 องศา คือเพลงที่มีชื่อว่าอะไร",
        "answer": "วิชาตัวเบา",
        "choices": [
            "149.6",
            "วิชาตัวเบา",
            "เรือเล็กควรออกจากฝั่ง",
            "ครึ่งๆ กลางๆ",
            "ปรากฏการณ์ผีเสื้อ"
        ]
    },
    "jigsaw": {
        "image": "public/img/jigsaw.png",
        "answer": "ตูน บอดี้สแลม",
        "question": "หลังจิ๊กซอว์นี้ นี่คือภาพของบุคคลที่เกี่ยวข้องกับวง Bodyslam ที่มีชื่อว่าอะไร"
    },
    "attribute": {
        "clues": [
            "มีปล่อยเป็นซิงเกิล",
            "ชื่อเพลงมี 2 พยางค์",
            "1 ในเพลงที่เคยได้รับรางวัลจาก คมชัดลึก อวอร์ดส์",
            "ตูนร้อง กบ Big Ass แต่ง",
            "อยู่ในอัลบั้ม Save My Life"
        ],
        "answer": "ยาพิษ"
    }
};

export default GAME_CONFIG;
